app/controllers/main_controller.rb

    def index
        # flash[:notice] = "Logged in successfully"
        # flash[:alert] = "Invalid email or password"

        if session[:user_id]
            @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]