app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$SwEyycCeqyMJx3.alIVHRe47.X3kJ91WIZKh/bc4HnWOYViJVwgzy"], ["updated_at", "2021-03-30 23:09:12.812195"], ["id", 2]]
---
    def update
       if Current.user.update(password_params)