app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
    # render plain: 'Thanks'
    # params[:user]
    # => {"email"=>"george@gmail.com", "password"=>"123456", "password_confirmation"=>"123456"}
    # render plain: params[:user]
        @user =  User.new(user_params)
        if @user.save